Repository: Pathumi99/Viago-App
Catalog: lib/l10n/app_*.arb
Languages: si

# appTitle
source: Viago
si: වියාගෝ

source: Home
si: මුල් පිටුව

source: Activity
si: ක්‍රියාකාරකම්

source: Notifications
si: දැනුම්දීම්

source: Account
si: ගිණුම

source: Profile
si: පැතිකඩ

source: Edit Profile
si: පැතිකඩ තොරතුරු සංස්කරණය කරන්න

source: Notification Settings
si: දැනුම්දීම්

source: Language
si: භාෂාව

source: Security
si: ආරක්ෂාව

source: Theme
si: තේමාව

# help
source: Help & Support
si: උදව් සහ සහාය

source: Contact
si: සම්බන්ධතාව

# privacy
source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය

source: Logout
si: ඉවත් වන්න

source: Language Settings
si: භාෂා සැකසුම්

# chooseLanguage
source: Choose your preferred language
si: ඔබගේ කැමති භාෂාව තෝරන්න

source: Available Languages
si: ලබා ගත හැකි භාෂා

source: English
si: ඉංග්‍රීසි

source: Sinhala
si: සිංහල

source: Tamil
si: දමිළ

# languageChanged
source: Language changed to {language}
si: භාෂාව {language} ට වෙනස් කරන ලදී

source: Language Support
si: භාෂා සහාය

# languageSupportDesc
source: • All interface elements are translated • Date and time formats are localized • Number formats follow regional standards • Some content may remain in English
si: • සියලුම අතුරුමුහුණත් අංග පරිවර්තනය කෙරේ • දින සහ වේලා ආකෘති ප්‍රාදේශීයකරණය කෙරේ • අංක ආකෘති ප්‍රාදේශීය ප්‍රමිතීන් අනුගමනය කරයි • සමහර අන්තර්ගතයන් ඉංග්‍රීසි භාෂාවෙන් පැවතිය හැක

# selectLanguageInfo
source: Select your preferred language for the app interface. This will change all text and labels throughout the app.
si: යෙදුම් අතුරුමුහුණත සඳහා ඔබගේ කැමති භාෂාව තෝරන්න. මෙය යෙදුම පුරා සියලුම පෙළ සහ ලේබල වෙනස් කරයි.

source: Incoming Ride Requests
si: එන ගමන් ඉල්ලීම්

# manageRequests
source: Manage passenger ride requests
si: මගී වෙන්කිරීමේ ඉල්ලීම් කළමනාකරණය කරන්න

source: My Ride Requests
si: මගේ ගමන් ඉල්ලීම්

# trackRequests
source: Track your ride requests
si: ඔබගේ වෙන්කිරීමේ ඉල්ලීම් ලුහුබඳින්න

source: Matching Riders
si: ගැලපෙන ධාවකයන්

source: From
si: සිට

source: To
si: දක්වා

source: Ride Request
si: ගමන් ඉල්ලීම

source: Passenger Details
si: මගී විස්තර

source: Name
si: නම

source: Requested
si: ඉල්ලා ඇත

# accept
source: Accept Ride
si: ගමන පිළිගන්න

source: Reject
si: ප්‍රතික්ෂේප කරන්න

source: Accepted
si: පිළිගෙන ඇත

source: Rejected
si: ප්‍රතික්ෂේප කළා

source: Pending
si: නොකළ

source: Ride accepted!
si: ගමන පිළිගත්තා!

source: Ride rejected.
si: ගමන ප්‍රතික්ෂේප කළා.

# waitingResponse
source: Waiting for rider's response...
si: ධාවකයාගේ ප්‍රතිචාරය බලාගෙන සිටිමි...

source: Reviews
si: සමාලෝචන

source: Send Request
si: ඉල්ලීම යවන්න

source: Rate Ride
si: ගමන ශ්‍රේණිගත කරන්න

# noRequests
source: No incoming ride requests
si: එන ගමන් ඉල්ලීම් නැත

# requestsWillAppear
source: Requests will appear here when passengers request to share your rides
si: මගීන් ඔබගේ ගමන් වෙන්කර ගන්නා විට ඉල්ලීම් මෙතන පෙන්වයි

# noRideRequests
source: No ride requests found
si: ගමන් ඉල්ලීම් හමු නොවීය

# startRequesting
source: Start by requesting a ride!
si: ගමනක් ඉල්ලීමෙන් ආරම්භ කරන්න!

# noMatchingRiders
source: No matching riders found
si: ගැලපෙන ධාවකයන් හමු නොවීය

# adjustCriteria
source: Try adjusting your search criteria.
si: ඔබගේ සෙවීමේ නිර්ණායක සීරුමාරු කිරීමට උත්සාහ කරන්න.

# requestSent
source: Ride request sent successfully! 🚗
si: ගමන් ඉල්ලීම සාර්ථකව යවන ලදී! 🚗

# requestAccepted
source: Request accepted successfully! 🚗
si: ඉල්ලීම සාර්ථකව පිළිගත්තා! 🚗

# requestRejected
source: Request rejected successfully! 🚗
si: ඉල්ලීම සාර්ථකව ප්‍රතික්ෂේප කළා! 🚗
